Repository: Global19-atlassian-net/language-packs
Catalog: extensions/jupyterlab_git/locale/*/LC_MESSAGES/jupyterlab_git.po
Languages: pt_br

source: Suspend user interaction until commands finish
pt_br: Suspende a interação do usuário até que os comandos terminem

# schema
source: Suspend JupyterLab user interaction until Git commands (e.g., commit, pull, reset, revert) finish executing. Setting this to true helps mitigate potential race conditions leading to data loss, conflicts, and a broken Git history. Unless running a slow network, UI suspension should not interfere with standard workflows. Setting this to false allows for actions to trigger multiple concurrent Git actions.
pt_br: Suspende a interação do usuário no JupyterLab até o comando Git (por exemplo, commit, pull. reset. revert) terminar de executar. Definir como verdadeiro ajuda a mitigar as condições de corrida em potencial que levam à perda de dados, conflitos, e a um histórico de Git danificado. Ao menos que esteja executando em uma rede lenta, a suspensão do usuário de interface não deve interferir com o fluxo de trabalho padrão. Definir como falso permitem às ações em desencadear múltiplas ações concorrentes no Git.

source: Cancel pull merge conflict
pt_br: Cancelar conflito de mesclagem de pull

# schema
source: If true, when fetching and integrating changes from a remote repository, a conflicting merge is canceled and the working tree left untouched.
pt_br: Se verdadeiro, ao buscar e integrar mudanças de um repositório remoto, uma fusão conflitante é cancelada e a árvore de trabalho é deixada intacta.

source: Disable branch with changes
pt_br: Desativar o branch com mudanças

# schema
source: Disable all branch operations (new, switch) when there are changed/staged files
pt_br: Desativar todas as operações de branch (novo, troca) quando existem arquivos alterados/encenados

source: Display Git status updates
pt_br: Mostrar o update do status do Git

# schema
source: Display Git extension status updates in the JupyterLab status bar. If true, the extension displays status updates in the JupyterLab status bar, such as when pulling and pushing changes, switching branches, and polling for changes. Depending on the level of extension activity, some users may find the status updates distracting. In which case, setting this to false should reduce visual noise.
pt_br: Mostra a extensão dos status dos updates do Git na barra de status do JupyterLab. Se verdadeiro, a extensão mostra os updates do status na barra de status do JupyterLab, tais como mudanças em pulling e pushing, alternando os branches, e sondagem para mudanças. Dependendo no nível da extensão da atividade, alguns usuários podem encontrar as mudanças do status uma distração. Nesse caso, configurar isso para falso deve reduzir o ruído visual.

source: Show diff on double click
pt_br: Mostrar diff ao clicar duas vezes

# schema
source: If true, doubling clicking a file in the list of changed files will open a diff.
pt_br: Se verdadeiro, clicar com duplo clique em um arquivo da lista de arquivos alterados irá abrir a diff.

source: History count
pt_br: Contagem de históricos

# schema
source: Number of (most recent) commits shown in the history log
pt_br: Numero de commits (mais recentes) mostrados no histórico

source: Refresh interval
pt_br: Intervalo de atualização

# schema
source: Number of milliseconds between polling the file system for changes.
pt_br: Numero de milissegundos entre a sondagem dos arquivos do sistema para alterações.

# schema
source: jupyterlab-git settings.
pt_br: configurações do jupyterlab-git.

source: Simple staging flag
pt_br: Bandeira simples de adaptação

# schema
source: If true, use a simplified concept of staging. Only files with changes are shown (instead of showing staged/changed/untracked), and all files with changes will be automatically staged
pt_br: Se verdadeiro, use um conceito simplificado de adaptação. Apenas arquivos com mudanças serão mostrados (ao invés de mostrar adaptados/alterados/não rastreados), e todos os arquivos com mudanças serão automaticamente adaptados
